tutorials/multiphase/multiphaseInterFoam/laminar/damBreak4phaseFine/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alphaair 1
    volScalarFieldValue alphawater 0
    volScalarFieldValue alphaoil 0
    volScalarFieldValue alphamercury 0
);

regions
(
    boxToCell
    {
        box ( 0 0 -1 ) ( 0.1461 0.292 1 );
        fieldValues
        (
            volScalarFieldValue alphawater 1
            volScalarFieldValue alphaoil 0
            volScalarFieldValue alphamercury 0
            volScalarFieldValue alphaair 0
        );
    }
    boxToCell
    {
        box ( 0.1461 0 -1 ) ( 0.2922 0.292 1 );
        fieldValues
        (
            volScalarFieldValue alphawater 0
            volScalarFieldValue alphaoil 1
            volScalarFieldValue alphamercury 0
            volScalarFieldValue alphaair 0
        );
    }
    boxToCell
    {
        box ( 0 0 -1 ) ( 0.1461 0.1 1 );
        fieldValues
        (
            volScalarFieldValue alphawater 0
            volScalarFieldValue alphaoil 0
            volScalarFieldValue alphamercury 1
            volScalarFieldValue alphaair 0
        );
    }
);


// ************************************************************************* //
